
// Процедура заполняет табличный документ для печати.
//
// Параметры:
//	ТабДок - ТабличныйДокумент - табличный документ для заполнения и печати.
//	Ссылка - Произвольный - содержит ссылку на объект, для которого вызвана команда печати.
Процедура КарточкаКонтрагента(ТабДок, Ссылка) Экспорт
	//{{_КОНСТРУКТОР_ПЕЧАТИ(КарточкаКонтрагента)
	Макет = Справочники.Контрагенты.ПолучитьМакет("КарточкаКонтрагента");
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ Контрагенты.Код,
		|	Контрагенты.Наименование,
		|	Контрагенты.ПолноеНаименованиеКонтрагента,
		|	Контрагенты.ОсновнойСчет,
		|	Контрагенты.ОсновнойДоговор,
		|	Контрагенты.ТипКонтрагента,
		|	Контрагенты.ИНН,
		|	Контрагенты.КПП,
		|	Контрагенты.АдресКонтрагента,
		|	Контрагенты.КонтактныеЛица.(
		|		НомерСтроки,
		|		КонтактноеЛицо,
		|		НомерТелефона)
		|ИЗ
		|	Справочник.Контрагенты КАК Контрагенты
		|ГДЕ
		|	Контрагенты.Ссылка В (&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьКонтактныеЛицаШапка = Макет.ПолучитьОбласть("КонтактныеЛицаШапка");
	ОбластьКонтактныеЛица = Макет.ПолучитьОбласть("КонтактныеЛица");
	Подвал = Макет.ПолучитьОбласть("Подвал");
	
	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		ТабДок.Вывести(ОбластьЗаголовок);
		
		Шапка.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Шапка, Выборка.Уровень());	
		ТабДок.Вывести(ОбластьКонтактныеЛицаШапка);
		ВыборкаКонтактныеЛица = Выборка.КонтактныеЛица.Выбрать();
		Пока ВыборкаКонтактныеЛица.Следующий() Цикл
			ОбластьКонтактныеЛица.Параметры.Заполнить(ВыборкаКонтактныеЛица);
			ТабДок.Вывести(ОбластьКонтактныеЛица, ВыборкаКонтактныеЛица.Уровень());
		КонецЦикла;
		
		Подвал.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Подвал);	
		
		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	//}}
КонецПроцедуры
