&НаКлиенте
Процедура НомерСчетаПриИзменении(Элемент)
    СформироватьНаименованиеСчета();
КонецПроцедуры

&НаКлиенте
Процедура БанкПриИзменении(Элемент)
    СформироватьНаименованиеСчета();
КонецПроцедуры

&НаСервере
Процедура СформироватьНаименованиеСчета()
    Если ПустаяСтрока(Объект.НомерСчета) Тогда
        Возврат;
    КонецЕсли;
    
    НаименованиеБанка = "?";
    Если Объект.Банк <> Неопределено Тогда
        НаименованиеБанка = Объект.Банк.Наименование;
    КонецЕсли;
    
    Объект.Наименование = "Р/с " + Объект.НомерСчета + " в " + НаименованиеБанка;
КонецПроцедуры