&НаКлиенте
Процедура УстановитьСкидку(Команда)
	УстановитьСкидкуНаСервере(ТекущаяСкидка);
    
    ПоказатьОповещениеПользователя("Новая скидка установлена!");
КонецПроцедуры

&НаСервере
Процедура УстановитьСкидкуНаСервере(НоваяСкидка)
		
	МенеджерЗаписи = РегистрыСведений.СкидкиПокупателей.СоздатьМенеджерЗаписи();
	
	МенеджерЗаписи.Период = НачалоДня(ТекущаяДата());
	МенеджерЗаписи.Контрагент = Объект.Владелец;
	МенеджерЗаписи.Договор = Объект.Ссылка;
	
	МенеджерЗаписи.Скидка = НоваяСкидка;
	
	МенеджерЗаписи.Записать();
КонецПроцедуры

&НаСервере
Процедура Сервер_ОбновитьСкидку()
	
	Отбор = Новый Структура;
	Отбор.Вставить("Контрагент", Объект.Владелец);
	Отбор.Вставить("Договор", Объект.Ссылка);
	
	ЗаписиРегистра = РегистрыСведений.СкидкиПокупателей.СрезПоследних(ТекущаяДата(), Отбор);
	
	Если ЗаписиРегистра.Количество() > 0 Тогда
		ТекущаяСкидка = ЗаписиРегистра[0].Скидка;
	Иначе
		ТекущаяСкидка = 0;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Сервер_ОбновитьСкидку()
КонецПроцедуры
